;自定义文件
;本文件对应MainPanel右面板组合Skin
;将在MainPanel中覆盖Settings.ini中的配置
[Variables]

;MainPanel
;设置使用的终端配置
MainPanelTerminalType=Music
;可用选项: Music Steam Weather
;--------------------


;音乐终端
MusicTerminalTitle=终端
MusicTerminalIcon=#@#Icons\Combat.png
MusicTerminalSanLabel=理智
MusicTerminalState=当前
MusicTerminalStatePause=暂停
MusicTerminalNowIdle=全部完成
MusicTerminalAction=[!CommandMeasure mLocalPlayer "OpenPlayer"]

;关闭图标投影
MusicTerminalHideIconBackdrop=0
;--------------------


;"Clostore"
SteamTerminalTitle=终端
SteamTerminalIcon=#@#Icons\Combat.png
SteamTerminalSanLabel=理智
SteamTerminalState=当前
SteamTerminalNowIdle=全部完成
SteamTerminalAction=[steam://open/games]

;关闭图标投影
SteamTerminalHideIconBackdrop=0
;--------------------


;天气终端
WeatherTerminalTitle=终端
WeatherTerminalIcon=#@#Icons\Combat.png
WeatherTerminalSanLabel=最低
WeatherTerminalState=当前
WeatherTerminalAction=[https://weather.com/zh-CN/weather/today]

;关闭图标投影
WeatherTerminalHideIconBackdrop=0
;--------------------


;按钮。
Button1Title=编队
Button1Desc=
Button1Icon=#@#Icons\Squads.png
Button1Action=[]

Button2Title=干员
Button2Desc=角色管理
Button2Icon=#@#Icons\Operator.png
Button2Action=[]
;--------------------


;龙门币色按钮
BrowserTitle=采购中心
BrowserIcon=#@#Icons\Store.png
BrowserAction=[http:]

LinksBarText=招募
LinksBarIcon=#@#Icons\Recruitment.png

Link1Text=公开招募
Link1Icon=#@#Icons\Recruit.png
Link1Action=[https://space.bilibili.com/161775300/dynamic]

Link2Text=干员寻访
Link2Icon=#@#Icons\Headhunt.png
Link2Action=[https://prts.wiki]
;--------------------


;任务按钮
BtnDecoTitle=任务
BtnDecoIcon=#@#Icons\Mission.png
BtnDecoAction=[explorer shell:::{3080F90E-D7AD-11D9-BD98-0000947B0257}]
;--------------------


;储存监控按钮
StorageTitle=基建
StorageIcon=#@#Icons\Base.png
StorageAction=[::{20D04FE0-3AEA-1069-A2D8-08002B30309D}]

BinTitle=仓库
BinIcon=#@#Icons\Depot.png
BinAction=[::{645ff040-5081-101b-9f08-00aa002f954e}]

BinNotifyAction=[!CommandMeasure mRecycleBin EmptyBin]
;--------------------